[
    {
        "Title": "Software Developer and Business Process Developer",
        "Job Description": "Knowledge of GDPR and its impacts on technology (experience with GDPR solutions)Experience in front end development like react, HTML, CSS, JavaScript etc.\nImplementing and integrating with REST APIs\nFamiliarity/experience with AWS Environment/Toolset, e.g., Lambda, Terraform, CloudWatch, S3, EC2, SSM, Experience with source control, Git, REST APIs and SQL\nExperience with Containers/Docker, CI/CD: Concourse, Maven, Functional testing\nExperience with SonarQube and Splunk or similar systems, components, or tools.\"\nRole: Full Stack Developer\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "Business processMavenFront endGITFunctional testingJavascriptsplunkHTMLAWSSQL"
    },
    {
        "Title": "Software developer",
        "Job Description": "Join GlobalLogic, to be a valid part of the team working on a huge software project for the world-class company providing M2M / IoT 4G/5G modules eg to the automotive, healthcare and logistics industries\nThrough our engagement, we contribute to our customer in developing the end-user modules firmware, implementing new features, maintaining compatibility with the newest telecommunication and industry standards, as well as performing analysis and estimations of the customer requirements\nRequirements: Requirements:\n5+ years of professional software development experience\n4+ years of experience with Python\n4+ years of experience in React JS\nGood exp in AIML, min 3 yrs\nExtensive experience with CI/CD tools:\nExtensive experience with cloud service provider: AWS, AWS S3\nExperience in developing large scale products in the field of industrial automation is a strong plus.\nStrong understanding of web application best practices and git development flow\nFocused, dependable, detail-oriented and hands-on - completes tasks quickly and thoroughly\nExcellent work ethics and communication skills - written, verbal and interpersonal\nGood command of written and spoken English, good team player, drive to grow and learn.\nJob Responsibilities:\nDesigning and developing back-end components of scalable software using Python, designing and implementation of robust applications with reusable, testable and efficient code.\nIntegrating of data storage solutions (database architecture).\nDeveloper testing, performance testing, code review and refactoring of the code.\nWorking with versioning control (Git), CI/CD processes, containerization (Docker) and DevOps practices using cloud service provider technologies (AWS, AWS S3).\nWorking with agile development methodologies (Scrum, Kanban, SAFe).\nWorking with distributed teams.\nRole: Software Development - Other\nIndustry Type: Consumer Electronics & Appliances\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "TelecomSemiconductorDevelopment ManagerPerformance testingTelecommunicationHealthcareFirmwareAutomotivePythonLogistics"
    },
    {
        "Title": "Software Developers",
        "Job Description": "Description: You might be responsible for the replacement of a whole system based on the specifications provided by an IT analyst, but often youll work with off the shelf software, modifying it and integrating it into the existing network. The skill in this is creating the code to link the systems together.\nDescription:\nYou might be responsible for the replacement of a whole system based on the specifications provided by an IT analyst, but often youll work with off the shelf software, modifying it and integrating it into the existing network. The skill in this is creating the code to link the systems together.\nApply Now\nYoull also be responsible for:\nReviewing current systems\nPresenting ideas for system improvements, including cost proposals\nWorking closely with analysts, designers and staff\nProducing detailed specifications and writing the programme codes\nPreparation of training manuals for users\nMaintaining the systems once they are up and running\nRole: Back End Developer\nIndustry Type: Software Product\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "It AnalystTrainingSoftware"
    },
    {
        "Title": "Software Developer (C# , Angular)",
        "Job Description": "Skill - Python is added advantage\n6+ years of experience in software development, engineering, testing, or a related field. Solid software engineering fundamentals gained through training, course work, or relevant experience\n6+ years experience as software engineer or similar role\n6+ years of experience with c#.net, RESTful APIs (WebAPI/NancyFx/ServiceStack)\n3+ years' of experience with Front-end JavaScript frameworks like AngularJS/Angular/ReactJS\n3+ years' of experience with HTML5, CSS3\n4+ years hands on experience with debugging and troubleshoot application\n4+ years experience with databases table design\n3+ years hands on experience writing shell scripts *nix/windows is a plus\n3+ experience with application build and deployment\nExperience in deployment applications in IIS WebServer, Windows Service\nExperience with CI/CD pipeline (Jenkins, SaltStack/Chef/Ansible, Git)\nExperience with Queue Messaging (ActiveMQ/RabbitMQ/Kafka)\nExperience with NoSql databases (Cassandra/MongoDB/ScyllaDB)\nExperience with Java Grovy is a plus\nBasic understanding of networking flows is a plus.\nAdvanced knowledge in multiple technologies relevant to current activities in the business unit\nDemonstrates a systematic structured problem- solving approach\nAdvanced working knowledge of most technologies relevant to our core business\nAbility to generalize a specific problem and derive solution for a class of problem\nAbility to derive causal relationship from ambiguous data\nRole: Software Developer in Test (SDET)\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Quality Assurance and Testing\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "activemqIISFront endGITNetworkingDebuggingJavascriptWindowsPythonCSS3"
    },
    {
        "Title": "Guidewire Software Developer/Engineer",
        "Job Description": "Must have Guidewire Software development experience. Guidewire is a Software used in the Insurance Industry.\n\nJob Requirements:\n3-7 years of experience with Guidewire Billing Center analysis, developing writing code\nGuidewire Developer Cloud Certification -- Associate Certification - Insurance Suite 10.0 Developer\n3 years experience working with medium to complex assignments and structures.\nCollege degree in computer science or other technical field or equivalent work experience.\nRole: Back End Developer\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "BillingCloud"
    },
    {
        "Title": "Software Developer",
        "Job Description": "Education: Bachelor s Degree in Engineering/MCA\nKey Skills: C# (Core Programming Skills), Windows Communication Foundation (WCF), Windows Presentation Foundation (WPF) and MS SQL Server. Would be preferred if you have a core Experience in Retail and Relevant Technology field.\nRoles and Responsibilities:\nTake care of multiple programming assignments of varied scope and complexity.\nWork under the general direction of a senior engineer. You will be responsible for a project or part of a project or operation requiring a thorough knowledge of engineering and related fields.\nGenerate SW design documents using Code, perform SW Design tests Source code verification etc.\nManage collaborate with the Product Development team. Coordinate release and sprint planning\nWell organized, good communication and reporting skills\nAbility to successfully work under tight project deadlines\nBe a perfectionist in everything you do\n  Role: Full Stack Developer\nIndustry Type: Software Product\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: B.Tech/B.E. in Production/Industrial, Any Graduate\nPG: MCA in Computers",
        "Key Skills": "IT servicesHealth insuranceMS SQLWindows communication foundationConsultingProgrammingApplication developmentWCFWPFWindows Presentation Foundation"
    },
    {
        "Title": "Software Developer",
        "Job Description": "Analyze business requirements; identify product impact and possible implementation options, and recommend the solution that best suits the needs of the customers and HLG.\nCreate and maintain application code that meets design specifications, follows HLG standards, and is easy to maintain.\nPerform code review for technical accuracy, standards, and functional compliance to the requirements.\nProvide Level 3 support of our applications.\nAbility to estimate work as requested.\nWork within deadlines in relation to product release timelines, and consistently complete assigned development tasks in required timeframes.\nFulfill administrative reporting requirements.\nWhat are we looking for\nBachelor's Degree or equivalent work experience in Computer Science or related discipline\n5+ years of C# programming experience\nDemonstrated understanding of OOP and programming best practices\nExperience with software requirements specifications, and strong interpretative skills to understand design requirements\nExperience developing software in a team environment.\nGreat communication skills, both verbal and written, that includes ability to communicate with internal and external people as changes occur in tasks assigned\nCustomer-service orientation\nAble to work independently as well as part of a team\nMicrosoft SQL Server experience\nMinimal travel required.\nWhat we would love to see\nExperience with unit/integration/automation testing\nAgile practices knowledge\nKnowledge of municipal operations, billing or financial systems\nExperience with Git\nWeb programming / JavaScript experience\nExperience with Linq and Entity Framework\nExperience with Azure Services\nExperience with IIS\nExperience with Web Security\nWhat we offer\nHarris offers excellent fringe benefits including a generous vacation policy and health, dental, life and disability insurance.\nSalary will be commensurate with experience and job responsibilities.\nRole: Software Developer in Test (SDET)\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Quality Assurance and Testing\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "AdministrationIISLINQGITBillingJavascriptAgileProgrammingEntity framework"
    },
    {
        "Title": "Remote Software Developer",
        "Job Description": "  Intermediate to advanced English\nTest and implement applications and systems\nWrite clean and scalable code\nReview, update and debug code\nEnhance existing software\nUpgrading and debugging existing systems\nRole: Software Developer in Test (SDET)\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Quality Assurance and Testing\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "DebuggingTesting"
    },
    {
        "Title": "Software Developer",
        "Job Description": "Collaborate with cross-functional teams to understand requirements and develop software solutions.\nDesign, code, test, debug, and document software applications based on client needs.\nDevelop technical designs and specifications based on conceptual ideas and business requirements.\nMaintain and enhance existing software applications to optimize performance and user experience.\nTroubleshoot and resolve issues in software applications as needed.\nStay updated on emerging technologies and industry trends to suggest improvements in the development process.\nWork in an Agile development environment and participate in sprint planning, code reviews, and other Agile ceremonies.\nRequirements:\nBachelors degree in Computer Science, Software Engineering, or a related field (or equivalent experience).\nProven experience as a Software Developer or Software Engineer.\nProficiency in programming languages such as Java, C++, Python, JavaScript, etc\nFamiliarity with development frameworks and tools like React, Angular, Node.js, etc\nStrong understanding of software development methodologies, design patterns, and best practices.\nExperience with databases (SQL, NoSQL) and version control systems (Git, SVN).\nAbility to work both independently and collaboratively in a team environment.\nExcellent problem-solving skills and attention to detail.\nPreferred Qualifications:\nExperience with cloud-based technologies (AWS, Azure, Google Cloud).\nKnowledge of DevOps practices and CI/CD pipelines.\nFamiliarity with mobile app development (iOS/Android).\nCertification in relevant technologies or frameworks.\nRole: Software Development - Other\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "C++Version controlGITNoSQLJavascriptApplication softwareSQLAndroidPython"
    },
    {
        "Title": "Software Developers",
        "Job Description": "Design and develop high-volume, low-latency applications for mission-critical systems, ensuring top-tier availability and performance.\nContribute to all phases of the product development lifecycle.\nWrite well-designed, testable, and efficient code.\nEnsure designs comply with specifications.\nPrepare and produce releases of software components.\nSupport continuous improvement by investigating alternate technologies and presenting these for architectural review.\nRole: Software Development - Other\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "SANUsageHead Business DevelopmentPDFSOCSMSVendorContinuous improvementCRMI18n"
    },
    {
        "Title": "Mulesoft Software Developer",
        "Job Description": "Mulesoft Certified Sr (8-12 yrs) Developers/Consultants\nExpertise in Anypoint platform components: API Manager, Runtime Manager, Exchange, Access Management, Design centre, MQ, Monitoring\nGood experience in API management, RAML design and implemented policies like OAuth2, Basic, JWT, IP whitelist, request throttling and spike control on APIs.\nExperienced in implementing Service Oriented Architecture (SOA) with SOAP/RESTful web services.\nAny experience in Financial Services( Banking ) industry experience is preferred\nMule Studio 7.x, Mule Runtime 3.x/4.x, API Manager, API Gateway 2.x, RAML 1.0, Dataweave 2.x, Anypoint Platform, Access Management, Anypoint MQ 2.x, Mule Connectors, Exchange, Design Center, Monitoring, API Led Architecture, Micro services\nRole: Software Development - Other\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "Web servicesSOAArchitectureAccess managementBankingBusiness solutionsSOAPMonitoringFinancial services"
    },
    {
        "Title": "Software Developer",
        "Job Description": "- Develop high-quality software design and architecture\n- Identify, prioritize and execute tasks in the Agile development environment\n- Develop tools and applications by producing clean, efficient code\n- Automate tasks through appropriate tools and scripting\n- Review and debug code\n- Perform validation and write unit test cases\n- Document development phases and monitor systems\n- Ensure software is up-to-date with latest technologies\n  Work exp\nGolang / Python / NodeJS / PHP Very good communication skills\nStrong Programming concept Organized and articulative personality\nExp of Microservices architecture\nProduct development experience\nRole: Full Stack Developer\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: B.Tech/B.E. in Production/Industrial\nPG: M.Tech in Electronics/Telecommunication",
        "Key Skills": "Software designArchitectureAgile developmentDebuggingPHPTest casesUnit testingMonitoringPythonScripting"
    },
    {
        "Title": "Software developer with OSS/BSS",
        "Job Description": "Skills:\nShould have a minimum of 1-2 years in software development.\nMust have Exposure to the following programming language:\nUnix Shell scripting\nPython or C (Python preferred)\nSQL or Oracle PL/SQL\nGood to Have:\nPrior experience in any Telecom Mediation\n  Role: Software Development - Other\nIndustry Type: Recruitment / Staffing\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "TelecomBssProgrammingPLSQLDeploymentBudgetingUnix shell scriptingPython"
    },
    {
        "Title": "Software Developer - ReactJS",
        "Job Description": "We are looking for developers who are proficient with ReactJS. Must also have strong understanding of development in web applications. The primary focus of the role will be on developing user interface components and implementing them using ReactJS. You will ensure that these components and the overall application are robust and easy to maintain. You will coordinate with the rest of the team working on different layers of the infrastructure. Therefore, a commitment to collaborative problem solving, sophisticated design, and quality product is important.\nJob Responsibilities\n\n- Developing new user-facing features using ReactJS\n- Building reusable components and front-end libraries for future use\n- Translating designs and wireframes into high-quality code\n- Optimizing creating components for maximum performance across a vast array of capable devices\n- Coding/Debugging apps\n- Review codes of the team\n\nRole Requirements\n\n- Should have working experience of 2-5 years in creating high scalable cross-platform mobile applications\n- Strong JavaScript-based mobile application development experience\n- Should have excellent knowledge of the React framework\n- Ability to architect, refactor, and debug an app without disrupting users\n- Experience with implementing complex native mobile UIs\n- Proficient with mobile application lifecycles\n- Good understanding of the Agile development process\nRole: Full Stack Developer\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "Product qualityMobile application developmentFront endCodingAgile developmentDebuggingJavascriptInfrastructureMobile applications"
    },
    {
        "Title": "Software Developer - NodeJS",
        "Job Description": "We are looking for a Node.js Developer responsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a basic understanding of front-end technologies is necessary as well.\nRole Description\n\n- Integration of user-facing elements developed by front-end developers with server side logic\n- Writing reusable, testable, and efficient code\n- Design and implementation of low-latency, high-availability, and performant applications\n- Implementation of security and data protection\n- Integration of data storage solutions\n- Product Support of the services\n- Configuring/Deploying the Production, Staging and Test environments\n\nRole Requirements\n\n- 3+ years experience in NodeJS\n- Strong proficiency with JavaScript\n- Knowledge of Node.js and frameworks available for it like Loopback, ExpressJS etc\n- Understanding the nature of asynchronous programming and its quirks and workarounds\n- Good understanding of server-side templating languages like Jade, EJS, etc\n- Good understanding of server-side CSS preprocessors such as Stylus, Less, etc\n- Basic understanding of front-end technologies, such as HTML5, and CSS3\n- Understanding accessibility and security compliance\n- User authentication and authorisation between multiple systems, servers, and environments\n- Integration of multiple data sources and databases into one system\n- Understanding fundamental design principles behind a scalable application\n- Understanding differences between multiple delivery platforms, such as mobile vs. desktop, and optimising output to match the specific platform\n- Creating database schemas that represent and support business processes\n- Implementing automated testing platforms and unit tests\n- Proficient understanding of code versioning tools, such as Git\nRole: Software Development - Other\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "security complianceAutomation testingFront endGITHP data protectorJavascriptDatabaseProduct supportCSS3"
    },
    {
        "Title": "Software Developer",
        "Job Description": "Developing applications (coding, programming)\nDebugging and testing code\nDocumenting and testing new software applications\nResearching, investigating, and fixing a wide range of technical issues\nCollaborating with senior leaders\nApproaching problems and create solutions\nProactively learn new technologies\nDesigning and developing applications using Java EE platforms\nWhat we are looking for\nBachelor s/Master s Degree in Computer Science or Engineering degree\n2+ years of application development in Java and Python, designing, coding, and debugging\nSpring Security, Spring Framework, JPA, Hibernate, Spring Batch Jobs and Spring Boot\nExperience in any scripting language\nSuperb communication, problem-solving skills\nExcellent communication skill\nFlexible in learning new technology\nRole: Software Development - Other\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "Hibernatespring securitySpring frameworkCodingspring batchDebuggingApplication developmentJPAPython"
    },
    {
        "Title": "Software Developer",
        "Job Description": "Experience in programming Embedded C++ applications with strong background in C++ inheritance, templates and pointers.\nStrong in OS concepts like efficient multi-threading and resource-sharing.\nExperience in Lauterbach debugging.\nExperience in Application development and Image chain processing.\nStrong communication and interpersonal skills.\nMust be a self-starter.\nAbility to work as part of a dedicated project team and independently\nStrong C++ Programming skills\nAutomotive domain\nDesign methodology using OOAD UML\nEmbedded development tools and methodologies\nVersion Control Systems Clear Case / RTC /GIT\nStrong development experience in embedded C and RTOS\nShould have detailed knowledge on microcontrollers / microprocessors (Xilinx ZU04, ARM, Renesas, NXP S32G preferable)\nStrong development experience in Ethernet/ Flexray, HSUSRT and communication protocols\nKnowledge in tools like CANalyser / CANoe, CANDiva, CANstress, CANDELA studio, Lauterbach\nExperience in Agile methodologies, configuration management defect tracking tools\nStrong debugging skills\nExperience in using tools like Logiscope / Function Generator / Oscilloscope, etc.\nPan India\nRole: Embedded Systems Engineer\nIndustry Type: Recruitment / Staffing\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "RTOSEmbedded CUMLOOADConfiguration managementEthernetDebuggingAgileApplication developmentAutomotive"
    },
    {
        "Title": "Software developer",
        "Job Description": "Develop object-oriented models and design data structures for new software projects and implement business logic and data models with a suitable class design.\nConduct software analysis, programming, testing, and debugging, as well as recommending changes to improve the established processes.\nRecommend software solutions to emerging needs in banking functionality and report ability.\nSolve complex problems in an innovative way and deliver quality solutions while taking ownership and accountability of assigned things.\nDemonstrate good learnability and adopt technologies that help build large scale, performant, reliable and sustainable systems.\nCollaborating with peers and architects on all elements of the development process.\nWho You'll Need to Be:\nB.E or B.Tech in Computer Science or any equivalent degree.\nMinimum 2 years of strong coding skills with strong hands-on and practical working experience in Java.\nStrong competencies in Data Structures, algorithms and their space-time complexities.\nGood problem-solving skills, coupled with strong analytical thinking and communication.\nExcellent debugging skills.\nPAN India\nRole: Full Stack Developer\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: B.Tech/B.E. in Any Specialization\nPG: Any Postgraduate",
        "Key Skills": "Software Development Engineer 2CodingAnalyticalSoftware Development ManagerDebuggingAgileData structuresSoftware solutionsVisual Design"
    },
    {
        "Title": "Software Developer Intern",
        "Job Description": "Experience in C++/C# programming Experience in MySQL Knowledge of working of Windows OS Knowledge of Java, GO language Knowledge of User Interface Designing Detail Oriented Individual with ability to follow written procedures with\nminimal direction Good verbal communication and technical writing skills\nResponsibilities:\nDeveloping applications Designing, Coding, Unit testing and documentation of software\ncomponents and features Working with software engineering team to meet deliverables Assessing new application ideas Researching the competitor offerings Reporting the progress on regular basis as required\nFlexible, according to work requirement Remote work (Work from home) considering current scenario\nRole: Back End Developer\nIndustry Type: Software Product\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate\nPG: Any Postgraduate",
        "Key Skills": "C++Windows OSSoftware Developer InternUser interface designingTechnical writingCodingMySQLHTMLUnit testingResearch"
    },
    {
        "Title": "Software Developer",
        "Job Description": "* Strong working experience on Java8\n* Hands on working experience on Spring boot, Hibernate and Microservices\nRole: Software Development - Other\nIndustry Type: IT Services & Consulting\nDepartment: Engineering - Software & QA\nEmployment Type: Full Time, Permanent\nRole Category: Software Development\nEducation\nUG: Any Graduate",
        "Key Skills": "Skills highlighted with ‘‘ are preferred keyskills"
    }
]